1. Функциональная пригодность (3): полнота, корректность, уместность
2. Производительность (3): временная эффективность, ресурсы, пропускная способность
3. Совместимость (2): сосуществование, взаимодействие
4. Удобство использования (3): распознаваемость, обучаемость, защита от ошибок
5. Надёжность (4): зрелость, доступность, отказоустойчивость, восстанавливаемость
6. Безопасность (4): конфиденциальность, целостность, неотказуемость, аутентичность
7. Сопровождаемость (4): модульность, повторное использование, анализируемость, тестируемость
8. Переносимость (3): адаптируемость, устанавливаемость, замещаемость
9. Качество данных (2): полнота данных, актуальность данных